install package

- `$ pip3 install mysqlclient`

In [1]:
import MySQLdb, pickle
import pandas as pd

In [2]:
pw = "trio034*"

##### Connect

In [3]:
db = MySQLdb.connect(
    "127.0.0.1",
    "root",
    pw,
    "city_info",
    charset='utf8',
)

##### Select

In [4]:
SQL_QUERY = """
    SELECT *
    FROM popular;
"""

In [5]:
curs = db.cursor()
count = curs.execute(SQL_QUERY)
count

7

In [6]:
rows = curs.fetchall()
rows

((1, 'seoul', 9904313),
 (2, 'busan', 3448737),
 (3, 'incheon', 2890451),
 (4, 'daegu', 2466052),
 (5, 'daejeon', 1538394),
 (6, 'gwanggju', 1502881),
 (6, 'gwanggju', 1502881))

In [7]:
for row in rows:
    print(row)
# db.close()

(1, 'seoul', 9904313)
(2, 'busan', 3448737)
(3, 'incheon', 2890451)
(4, 'daegu', 2466052)
(5, 'daejeon', 1538394)
(6, 'gwanggju', 1502881)
(6, 'gwanggju', 1502881)

##### insert, update, delete

In [8]:
SQL_QUERY_2 = """
    INSERT INTO popular(rank, city_name, popular)
    VALUES(6, "gwanggju", 1502881)
"""

In [9]:
curs = db.cursor()
count = curs.execute(SQL_QUERY_2)
db.commit()
# db.close()

##### database -> dataframe

In [10]:
city_df = pd.read_sql(SQL_QUERY, db)
city_df

   rank city_name  popular
0     1     seoul  9904313
1     2     busan  3448737
2     3   incheon  2890451
3     4     daegu  2466052
4     5   daejeon  1538394
5     6  gwanggju  1502881
6     6  gwanggju  1502881
7     6  gwanggju  1502881

##### dataframe -> database

install package
- `$ pip3 install sqlalchemy`

In [11]:
import seaborn as sns
from sqlalchemy import create_engine

In [12]:
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [15]:
engine = create_engine("mysql+mysqldb://root:" + pw + "@localhost/city_info")

tips.to_sql(name="tips", con=engine, if_exists='replace')

In [16]:
engine = create_engine("mysql+mysqldb://root:" + pw + "@13.125.226.4/test")

tips.to_sql(name="tips", con=engine, if_exists='replace')